app/controllers/students_controller.rb

INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Bill"], ["last_name", "Smith"], ["created_at", "2018-03-23 15:17:41.159258"], ["updated_at", "2018-03-23 15:17:41.159258"]]
---
  def create
    @student = Student.new(params.require(:student))
    @student.save